1：首先是自我介绍，
	以前在lg的时候，15年的时候，自学了一年，效果不太好，
	后来在明软干了一年多，每天就是用写页面，主要是bs跟react，小的就用bs，
	大一点的就用react，里面就是纯粹的码农，学不到啥东西，后来在极客学院学了大半年，
	主要是系统的学习，工具，框架的使用，angular，vue，react，
2：能力的水品，独立完成前台页面，完成手机端适配，后台php也能行，java的就不行了
3：因为发现网上好多招聘都要求vue的，所以给改了，这个也是我师傅帮我弄的，其实不是太懂，过了，长时间不用基本都忘了
4：框架主要用的webpack，
5：浏览器适配ie8以下都放弃了，
-----------------                    --------------
主要的是适应，不要紧张，多面试几次就好了，看他们啥反映，厚着脸皮上，
确实没办法，先说出来再说
1：肯定要提前半个小时去，路上半个小时，起码要提前一个小时，骑自行车会出汗的好吧，只能做公交。
2：说这个说那个没啥用，只能先适应再说。
---------------                   --------------

4：我觉得这份工作完全可以胜任，以前在lg的时候主要跟机械打交道，没怎么注重过处理人际关系，
导致了自学的效率太低了，后来跟人学习过怎么处理人际关系，所以我一半的收入都拿出来用在人际关系上，
我现在的学习效率要高多了，而且就算我有胜任不了的工作，也有人帮忙。
5：问一下你们是怎么带团队的，我觉得能学到东西，哪怕工资低一点都值得，公司里学不到东西
那也只能
