1：项目的体量估算--这涉及到项目的进度--十多个小时的教程；
2：项目所需的各个知识点----
3：构建过程中各种跑坑，怎样优化，笔记必须做好。
webapp
	前台：系统首页
		  选择城市
		  搜索页面
		  详情页面
		  收藏购买
		  登陆页面

	后台： 用户中心
		   评价功能

构建工具：webpack，less写css；postcss编译css   
系统框架：react react-router redux
数据交互：fetch --原生的promiss
数据库（模拟数据库）mock   
版本管理git


环境搭建：基础知识；实战开发
了解基础知识，关于js，html。webpack npm；fis3
前几年写什么上什么；现在需要压缩，

所有的问题都应该分好类，采用树状结构，并且多处串联。


收获：如何使用webpack开发系统；学会前端组件化。
解决前面遇到的问题；
---整个系统是跑通的---然后各个知识点是可以跑通的---各种问题是可以得到解决的
各种设想是可以得到验证的。
笔记做完了要方便以后随时看。

备忘的知识点：
xshell 模拟linx命令

