1：
基础信息
能力领域
项目信息---参与过的项目；
实战经历----必须得凑出来几个---各种类型的
			基础的：html的页面，css  js   jquery  nodejs   webpack   gulp  grunt less sass  php 
			中级的：angular react  vue  ligerui  jqueryui  bootstarp
			高级的：
			最终要证明，我会这些东西，以及能够熟练应用这些东西，以及  
工作经验---写写就算了


他看简历的时候，怎么看？
第一个肯定是时间，第二个肯定是技能领域  第三个肯定是项目做的怎么样，有没有实际的项目
最后要验证，--最后才是面试；--

第一关你就没过；
第一部分：基础信息--只能增加工作时间 --自学了一年，上了一年，培训了一年
第二部分：能力领域-- 逼格够高的一些关键词；
	初级----html css  js   jquery  nodejs   webpack   gulp  grunt less sass  php 
	中级----angular react  vue  ligerui  jqueryui  bootstarp        只能算中级的，
	高级----  高级的应该是自己封装sdk之类的

第三部分：参与过的项目--要抄过来；--还需要有对应的组件之类的，来证明确实写过这些项目；
初级项目
中级项目
高级项目


第四部分：对难点的理解分析
1：css动画
2：js动画，
3：js  原型与原型链，作用域与闭包，异步与单线程；
4：jquery  
5：angular，react ，vue  以及各自的项目，起码要开发出来一个初级的，商场类的，博客类的，互动类的；
6：安全的；
7：前台的部分，后端的部分--管理控制台；
8：linux也是有必要的
9：php到底有哪些高级能力；
10：英文的阅读能力；---官方文档；--中文版的容易老旧，更新不及时，起码菜鸟就是老版本的；
11：懒加载，瀑布流之类的，这个还算是简单的 问题是要多练习才能熟练

你的目标就是一点点把这些事情做完；
最后，不断的复习这些知识点，以及把这些知识点组织出几个大的项目出来，放上去；
另外还有任务前，关于前端的前沿资讯，以及寻找可以在这方面带我的人；


第五部分：别人的看法--------
一灯：前端页面是最low的部分；确实是这样；
前端架构师，es6，node，  es8确实都已经出来了，es6还不会确实太落后了
前端图形学工程师--









